Revit 2027 API
InitialFluxIntensity.Flux Property
 The flux intensity value.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Flux { get; set; }
Public Property Flux As Double
	Get
	Set
public:
property double Flux {
	double get ();
	void set (double value);
}
member Flux : float with get, set
Property Value
Double
 The flux value in lm as a numerical value between 0 and 1e+30.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The flux intensity value is not valid because it is not between 0 and 1e+30.
See Also
Reference
InitialFluxIntensity Class
Autodesk.Revit.DB.Lighting Namespace